app/controllers/messages_controller.rb

SELECT * FROM "spirits" WHERE ("spirits"."udid" = '00000000-0000-1000-8000-0017F2D5A88E') ORDER BY updated_at DESC LIMIT 1
---
  def create
    hobo_create do
      spirit = Spirit.find_by_udid(this.udid, :order=>"updated_at DESC");

SELECT * FROM "spirits" WHERE ("spirits"."name" = 'Molly') ORDER BY updated_at DESC LIMIT 1
SELECT * FROM "messages" WHERE ("messages"."udid" = '00000000-0000-1000-8000-0017F2D5A88E') ORDER BY updated_at DESC LIMIT 1
---
  def random
    # debugger
    udid = cookies[:udid]
    if params[:spirit] != ""
      spirit = Spirit.find_by_name(params[:spirit], :order => "updated_at DESC")
      if udid.nil?
        # we have a spirit, and no UDID, easy
        udid = spirit.udid if spirit
        cookies[:udid] = udid
      end
    end
    text = "0 yeehaw"
    if !udid.nil?
      message = Message.find_by_udid(udid, :order => "updated_at DESC")