app/controllers/spirits_controller.rb

  def create
    params[:spirit][:name] = params[:spirit][:name].downcase
    oldspirit = Spirit.find_by_name(params[:spirit][:name])
    if oldspirit && oldspirit.updated_at > Time.now - 1.hour
---
SELECT * FROM "spirits" WHERE ("spirits"."name" = 'awesome') LIMIT 1
UPDATE "spirits" SET "updated_at" = '2009-10-07 19:14:12' WHERE "id" = 19